c5/src/Documents/Return/Return.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Return</name>
  <basedOn>Document.Invoice</basedOn>
  <registerRecords>AccumulationRegister.SalesOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.Expenses</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrders</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccumulationRegister.Debts</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.Sales</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceDebts</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>CloseAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentOption</name>
    <type>
      <types>CatalogRef.PaymentOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Income</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Invoice</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesCost</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Return/Forms/Items/Module.bsl
&AtServer
var Env;
&AtClient
var ItemsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	setAccuracy ();
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	Document = Parameters.Return; 
	Invoice = Parameters.Invoice;
	Object.VATUse = Invoice.VATUse;
	
EndProcedure

&AtServer
Procedure setAccuracy ()
	
	Options.SetAccuracy ( ThisObject, "ItemsQuantity, ItemsQuantityPkg" );
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	fill ();
	if ( Object.Items.Count () = 0 ) then
		OutputCont.NoItemsToReturn ( new Structure ( "Document", Invoice ), , Invoice );
		Close ();			
	endif;
	
EndProcedure

&AtClient
Procedure loadData ()
	
	owner = FormOwner.Object;
	table = Object.Items;
	for each row in owner.Items do
		newRow = table.Add ();
		FillPropertyValues ( newRow, row ); 
	enddo;
	
EndProcedure

&AtServer
Procedure fill ()

	setEnv ();
	getData ();
	fillItems ();

EndProcedure

&AtServer
Procedure setEnv ()

	Env = new Structure ();
	SQL.Init ( Env );

EndProcedure

&AtServer
Procedure getData ()
	
	sqlItems ();
	getTables ();
	
EndProcedure

&AtServer
Procedure sqlItems ()
	
	salesOrder = "case when Items.SalesOrder = value ( Document.SalesOrder.EmptyRef ) then Items.Ref.SalesOrder else Items.SalesOrder end";
	s = "
	|// Existed
	|select Items.Invoice as Invoice, Items.Item as Item, Items.Feature as Feature, 
	|	Items.Series as Series, Items.SalesOrder as SalesOrder, Items.RowKey as RowKey,
	|	Items.Quantity as Quantity
	|into Existed
	|from &Items as Items
	|where Items.Invoice = &Invoice
	|;
	|// Returned
	|select Items.Invoice as Invoice, Items.Item as Item, Items.Feature as Feature, 
	|	Items.Series as Series, Items.SalesOrder as SalesOrder, Items.RowKey as RowKey,
	|	Items.Quantity as Quantity
	|into Returned
	|from Document.Return.Items as Items
	|where Items.Ref.Posted
	|and Items.Ref <> &Return
	|and Items.Invoice = &Invoice
	|;
	|// #Items
	|select true as Select, Items.Ref as Invoice, Items.Account as Account, Items.Amount as Amount, Items.Capacity as Capacity,
	|	Items.Discount as Discount, Items.DiscountRate as DiscountRate, Items.ExtraCharge as ExtraCharge, Items.Feature as Feature, 
	|	Items.Income as Income, Items.Item as Item, Items.Package as Package, Items.Price as Price, Items.Prices as Prices, Items.ProducerPrice as ProducerPrice,
	|	Items.Quantity - isnull ( Existed.Quantity, 0 ) - isnull ( Returned.Quantity, 0 ) as Quantity, Items.QuantityPkg as QuantityPkg, 
	|	Items.RowKey as RowKey, Items.SalesCost as SalesCost, " + salesOrder + " as SalesOrder, Items.Series as Series, Items.Social as Social, 
	|	Items.Total as Total, Items.VAT as VAT, Items.VATAccount as VATAccount, Items.VATCode as VATCode, Items.VATRate as VATRate, Items.Warehouse as Warehouse
	|from Document.Invoice.Items as Items
	|	//
	|	// Existed
	|	//
	|	left join Existed as Existed
	|	on Existed.Invoice = Items.Ref
	|	and Existed.Item = Items.Item
	|	and Existed.Feature = Items.Feature
	|	and Existed.Series = Items.Series
	|	and Existed.SalesOrder = " + salesOrder + "
	|	and Existed.RowKey = Items.RowKey
	|	//
	|	// Returned
	|	//
	|	left join Returned as Returned
	|	on Returned.Invoice = Items.Ref
	|	and Returned.Item = Items.Item
	|	and Returned.Feature = Items.Feature
	|	and Returned.Series = Items.Series
	|	and Returned.SalesOrder = " + salesOrder + "
	|	and Returned.RowKey = Items.RowKey
	|where Items.Ref = &Invoice
	|and Items.Quantity - isnull ( Existed.Quantity, 0 ) - isnull ( Returned.Quantity, 0 ) > 0
	|";
	Env.Selection.Add ( s );
	
EndProcedure

&AtServer
Procedure getTables ()

	q = Env.Q;
	q.SetParameter ( "Invoice", Invoice );
	q.SetParameter ( "Return", Document );
	q.SetParameter ( "Items", Object.Items.Unload () );
	SQL.Perform ( Env );

EndProcedure

&AtServer
Procedure fillItems ()
	
	source = Env.Items;
	receiver = Object.Items;
	receiver.Clear ();
	vatUse = Object.VATUse; 
	for each row in source do
		newRow = receiver.Add ();
		FillPropertyValues ( newRow, row );
		Computations.Packages ( newRow );
		Computations.Amount ( newRow );
		Computations.Total ( newRow, vatUse );
	enddo;
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure Select ( Command )
	
	p = new Structure ( "Items" );
	p.Items = Object.Items.FindRows ( new Structure ( "Select", true ) );
	NotifyChoice ( p );
	
EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure MarkAll ( Command )
	
	mark ( true );
	
EndProcedure

&AtClient
Procedure mark ( Flag )
	
	for each row in Object.Items do
		row.Select = Flag;
	enddo;

EndProcedure

&AtClient
Procedure UnmarkAll ( Command )
	
	mark ( false );
	
EndProcedure

&AtClient
Procedure ItemsTableOnActivateRow ( Item )
	
	ItemsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ItemsQuantityPkgOnChange ( Item )
	
	Computations.Units ( ItemsRow );
	Computations.Amount ( ItemsRow );
	Computations.Total ( ItemsRow, Object.VATUse );
	
EndProcedure

&AtClient
Procedure ItemsQuantityOnChange ( Item )
	
	Computations.Packages ( ItemsRow );
	Computations.Amount ( ItemsRow );
	Computations.Total ( ItemsRow, Object.VATUse );
	
EndProcedure
